{
  "name": "GitMCP",
  "description": "## 🤔 What is GitMCP?\n**Stop vibe-hallucinating and start vibe-coding!**\n\n[GitMCP](https://gitmcp.io) is a free, open-source, remote [Model Context Protocol (MCP)](https://docs.anthropic.com/en/docs/agents-and-tools/mcp) server that transforms **any** GitHub project (repositories or GitHub pages) into a documentation hub. It enables AI tools like Cursor to access up-to-date documentation and code, even if the LLM has never encountered them, thereby eliminating code hallucinations seamlessly.\n\nGitMCP supports **two flavors** -\n\n*   **Specific Repository (`gitmcp.io/{owner}/{repo}` or `{owner}.gitmcp.io/{repo}`):** Use these when you primarily work with a select number of libraries. This ensures your AI assistant always targets the correct project, enhancing security and relevance by preventing access to unintended repositories.\n*   **Generic Server (`gitmcp.io/docs`):** Use this for maximum flexibility when you need to switch between different repositories frequently. The AI assistant will prompt you (or decide based on context) which repository to access for each request. Be mindful that this relies on correctly identifying the target repository each time.\n\n**With GitMCP:**\n\n*   AI assistants access the *latest* documentation and code directly from the source.\n*   Get accurate API usage and reliable code examples.\n*   Work effectively even with niche, new, or rapidly changing libraries.\n*   Significantly reduced hallucinations and improved code correctness.\n\n## ✨ Features\n\n- 😎 **Latest Documentation on ANY GitHub Project**: Grant your AI assistant seamless access to the GitHub project's documentation and code. The built-in smart search capabilities help find exactly what the AI needs without using too many tokens!\n- 🧠 **No More Hallucinations**: With GitMCP, your AI assistant can provide accurate and relevant answers to your questions.\n- ☁️ **Zero Setup**: GitMCP runs in the cloud. Simply add the chosen GitMCP URL as an MCP server in your IDE — no downloads, installations, signups, or changes are required.\n- 💬 **Embedded Chat**: Start quickly by chatting directly with the repository's documentation through our in-browser chat!\n- ✅ **Open, Free, and Private**: GitMCP is open-source and completely free to use. It doesn't collect personal information or store queries. You can even self-host it!\n\n\n## ⚙ How It Works\n\nGitMCP connects your AI assistant to GitHub repositories using the Model Context Protocol (MCP), a standard that lets AI tools request additional information from external sources.\n\nWhat happens when you use GitMCP:\n\n1. **You provide the GitMCP URL** to your AI assistant (e.g., `gitmcp.io/microsoft/typescript`). GitMCP exposes tools like documentation fetching, smart search, code search, etc.\n2. **Prompt the AI assistant** on documentation/code-related questions.\n3. **Your AI sends requests** to GitMCP to use its tools (with your approval).\n4. **GitMCP executes the AI's request** and returns the requested data.\n5. **Your AI receives the information** and generates a more accurate, grounded response without hallucinations.\n\n### Supported Documentation\n\nGitMCP currently supports the following documents (in order of priority):\n1. [llms.txt](https://llmstxt.org)\n2. AI-optimized version of the project's documentation\n3. `README.md`/root\n\n## 💡 Examples\n\nHere are some examples of how to use GitMCP with different AI assistants and repositories:\n\n### Example 1: Using Windsurf with a specific repository\n\nFor the GitHub repository `https://github.com/microsoft/playwright-mcp`, add `https://gitmcp.io/microsoft/playwright-mcp` as an MCP server to Windsurf.\n\n**Prompt to Claude:**\n> \"How do I use the Playwright MCP\"\n\nWindsurf will pull the relevant documentation from GitMCP to implement the memory feature correctly.\n\n### Example 2: Using Cursor with a GitHub Pages site\n\nFor the GitHub Pages site `langchain-ai.github.io/langgraph`, add `https://langchain-ai.gitmcp.io/langgraph` as an MCP server to Cursor.\n\n**Prompt to Cursor:**\n> \"Add memory to my LangGraph agent\"\n\nCursor will pull the relevant documentation and code from GitMCP to correctly implement the memory feature.\n\n### Example 3: Using Claude Desktop with the dynamic endpoint\n\nYou don't have to pick specific repositories. The generic `gitmcp.io/docs` endpoint allows AI to pick the GitHub project on the fly!\n\n**Prompt to any AI assistant:**\n> \"I want to learn about the OpenAI Whisper speech recognition model. Explain how it works.\n\nClaude will pull the data from GitMCP and answer the question.\n\n## 🛠️ Tools\n\nGitMCP provides AI assistants with several valuable tools to help them access, understand, and query GitHub repositories.\n\n### `fetch_<repo-name>_documentation`\n\nThis tool gets the primary documentation from a GitHub repository. It works by retrieving relevant documentation (e.g., `llms.txt`). This gives the AI a good overview of what the project is about\n\n**When it's useful:** For general questions about a project's purpose, features, or how to get started\n\n### `search_<repo-name>_documentation`\n\nThis tool lets the AI search through a repository's documentation by providing a specific search query. Instead of loading all the documentation (which could be very large), it uses intelligent search to find just the relevant parts.\n\n**When it's useful:** For specific questions about particular features, functions, or concepts within a project\n\n### `fetch_url_content`\n\nThis tool helps the AI get information from links mentioned in the documentation. It retrieves the content from those links and converts it to a format the AI can easily read.\n\n**When it's useful:** When documentation references external information that would help answer your question\n\n### `search_<repo-name>_code`\n\nThis tool searches through the actual code in the repository using GitHub's code search. It helps AI find specific code examples or implementation details.\n\n**When it's useful:** When you want examples of how something is implemented or need technical details not covered in documentation\n\n> **Note:** When using the dynamic endpoint (`gitmcp.io/docs`), these tools are named slightly differently (`fetch_generic_documentation`, `search_generic_code`, and `search_generic_documentation`) and need additional information about which repository to access.\n\n## 📊 Badge\n\nGitMCP has a badge to your repository's README. It allows users to quickly access your documentation through their IDE or browser (using the embedded chat). It also showcases how many times your documentation has been accessed through GitMCP.\n\nExample (`idosal/git-mcp`): [![GitMCP](https://img.shields.io/endpoint?url=https://gitmcp.io/badge/idosal/git-mcp)](https://gitmcp.io/idosal/git-mcp)\n\n### Adding the Badge to Your Repository\n\nAdd the following to your `README.md`:\n\n```markdown\n[![GitMCP](https://img.shields.io/endpoint?url=https://gitmcp.io/badge/OWNER/REPO)](https://gitmcp.io/OWNER/REPO)\n```\n\nReplace `OWNER` with your GitHub username or organization, and `REPO` with your repository name.\n\n### How We Count Views\n\nIncrement for each tool call on the specific repository.\n\n### Customizing the Badge\n\nYou can customize the badge's appearance with parameters:\n\n| Parameter | Description | Default | Example |\n|-----------|-------------|---------|---------|\n| `color` | Color for the badge value | `aquamarine` | `?color=green` |\n| `label` | Badge label | `GitMCP` | `Documentation`\n\nPlease reach out!\n\n## ❓ FAQ\n\n### What is the Model Context Protocol?\n\nThe [Model Context Protocol](https://modelcontextprotocol.io/introduction) is a standard that allows AI assistants to request and receive additional context from external sources in a structured manner, enhancing their understanding and performance.\n\n### Does GitMCP work with any AI assistant?\n\nYes, GitMCP is compatible with any AI assistant supporting the Model Context Protocol, including tools like Cursor, VSCode, Claude, etc.\n\n### Is GitMCP compatible with all GitHub projects?\n\nAbsolutely! GitMCP works with any public GitHub repository without requiring any modifications. It prioritizes the `llms.txt` file and falls back to `README.md` or other pages if the former is unavailable. Future updates aim to support additional documentation methods and even generate content dynamically.\n\n### Does GitMCP cost money?\n\nNo, GitMCP is a free service to the community with no associated costs.\n\n## 🔒 Privacy\n\nGitMCP is deeply committed to its users' privacy. The service doesn't have access to or store any personally identifiable information as it doesn't require authentication. In addition, it doesn't store any queries sent by the agents. Moreover, as GitMCP is an open-source project, it can be deployed independently in your environment.\n\nGitMCP only accesses content that is already publicly available and only when queried by a user. GitMCP does not automatically scrape repositories. Before accessing any GitHub Pages site, the code checks for `robots.txt` rules and follows the directives set by site owners, allowing them to opt out. Please note that GitMCP doesn't permanently store data regarding the GitHub projects or their content.\n\n## 📄 License\n\nThis project is licensed under the [Apache License 2.0](https://raw.githubusercontent.com/idosal/git-mcp/refs/heads/main/LICENSE).\n\n## Disclaimer\n\nGitMCP is provided \"as is\" without warranty of any kind. While we strive to ensure the reliability and security of our service, we are not responsible for any damages or issues that may arise from its use. GitHub projects accessed through GitMCP are subject to their respective owners' terms and conditions. GitMCP is not affiliated with GitHub or any of the mentioned AI tools.\n\n\n## Star History\n\n[![Star History Chart](https://api.star-history.com/svg?repos=idosal/git-mcp&type=Timeline)](https://www.star-history.com/#idosal/git-mcp&Timeline)\n",
  "metadata": {
    "categories": "Developer Tools,Verified"
  },
  "icon": "https://avatars.githubusercontent.com/u/182288589?v=4",
  "repoURL": "https://gitmcp.io",
  "hostname": "gitmcp.io",
  "toolPreview": [
    {
      "name": "fetch_<repo>_documentation",
      "description": "Fetch entire documentation file from GitHub repository: <org>/<repo>. Useful for general questions. Always call this tool first if asked about <org>/<repo>."
    },
    {
      "name": "search_<repo>_documentation",
      "description": "Semantically search within the fetched documentation from GitHub repository: <org>/<repo>. Useful for specific queries.",
      "params": {
        "query": "The search query to find relevant documentation"
      }
    },
    {
      "name": "search_<repo>_code",
      "description": "Search for code within the GitHub repository: \"<org>/<repo>\" using the GitHub Search API (exact match). Returns matching files for you to query further if relevant.",
      "params": {
        "page": "Page number to retrieve (starting from 1). Each page contains 30 results.",
        "query": "The search query to find relevant code files"
      }
    },
    {
      "name": "fetch_generic_url_content",
      "description": "Generic tool to fetch content from any absolute URL, respecting robots.txt rules. Use this to retrieve referenced urls (absolute urls) that were mentioned in previously fetched documentation.",
      "params": {
        "url": "The URL of the document or page to fetch"
      }
    }
  ]
}